tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/systemid_angularOscillation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
12639
(
(0.999936 -3.28448e-05 -2.92219e-22)
(1.0003 -2.50223e-05 2.52809e-22)
(0.99922 -1.5147e-05 1.53782e-22)
(1.00016 -2.49879e-05 -2.20948e-22)
(1.00025 1.10974e-05 1.95978e-22)
(0.998561 -2.34503e-05 0)
(0.999265 -3.35852e-05 -6.81155e-23)
(1.00027 -1.08204e-05 0)
...
)
;

boundaryField
{
    flap
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    main
    {
        type            noSlip;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
