tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/systemid_angularOscillation/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
12639
(
6.76606e-05
7.01268e-05
6.73201e-05
7.1123e-05
6.8877e-05
6.27756e-05
6.91613e-05
7.31204e-05
...
)
;

boundaryField
{
    flap
    {
        type            fixedValue;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    main
    {
        type            fixedValue;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
