tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/systemid_angularOscillation/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
12639
(
0.000223982
0.000232614
0.000205993
0.000227953
0.000229473
0.000181587
0.000208055
0.000233105
...
)
;

boundaryField
{
    flap
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 6.1605e-05;
    }
    main
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
