tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/systemid_angularOscillation/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
12639
(
0.302081
0.301473
0.326808
0.312007
0.300153
0.345706
0.332419
0.31368
...
)
;

boundaryField
{
    flap
    {
        type            omegaWallFunction;
        value           uniform 0.600601;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 0.600601;
    }
    main
    {
        type            omegaWallFunction;
        value           uniform 0.600601;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
