tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/systemid_angularOscillation/system/copyMesh/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
        /*
        solver           GAMG;
        smoother         FDIC;
        tolerance        1e-08;
        relTol           0.01;
        
       
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        */

	minIter 	2;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        //$p;
        relTol           0;
        minIter		3;
    }

        "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.0;

	minIter			3;
    }

    "(U|k|omega|epsilon|nuTilda|q|zeta|ReThetat|gammaInt|kl|kt|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.01;
    }

    "(UFinal|kFinal|omegaFinal|epsilonFinal|nuTildaFinal|qFinal|ReThetatFinal|gammaIntFinal|klFinal|ktFinal|RFinal)"
    {
        $U;
                tolerance       1e-08;
        relTol           0;
    }
    "(cellDisplacement.*|cellMotionU.*)"
    //"(cellDisplacementFinal|cellMotionUFinal)"
    {
        /*
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        */
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;

	//minIter		3;
	//maxIter		100;
    }
}

"(SIMPLE|PISO)"
{
    consistent                 yes;
    nCorrectors                2;
    nNonOrthogonalCorrectors   2;
    pRefCell                   0;
    pRefValue                  0;

    residualControl
    {
        U         0.0001;
        p         0.0001;
        k         0.0001;
        omega     0.0001;
        epsilon   0.0001;
        nuTilda   0.0001;
        Rethetat  0.0001;
        gammaInt  0.0001;
        kl        0.0001;
        kt        0.0001;
        R         0.0001;
    }
}

PIMPLE
{
	//If enable you will need to add UFinal
	momentumPredictor yes;

	//If you set nOuterCorrectors to 1 is equivalent to piso    
        nOuterCorrectors 2;
	nCorrectors 3;
	nNonOrthogonalCorrectors 1;

	checkMeshCourantNo	yes;
}

relaxationFactors
{
    fields
    {
        p         1;
    }

    equations
    {
        U         1;
        k         1;
        omega     1;
        epsilon   1;
        nuTilda   1;
        ReThetat  1;
        gammaInt  1;
        kl        1;
        kt        1;
        R         1;
    }
}

// ************************************************************************* //
